# Show Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
SetupEnergySimulationDialog..::..Show Method
SetupEnergySimulationDialog Class See Also
---
Shows the SetupEnergySimulationDialog to the user as a modal dialog.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public SetupEnergySimulationDialogResult Show()
```

Visual Basic
---
```text
Public Function Show As SetupEnergySimulationDialogResult
```

Visual C++
---
```text
public:
SetupEnergySimulationDialogResult Show()
```

# ### Return Value
One of the SetupEnergySimulationDialogResult values.
# See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace